snlkuharlocal/src/Documents/ЗаявкаНаРекламацию/ЗаявкаНаРекламацию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаРекламацию</name>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Корреспондент</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаРекламации</name>
    <type>
      <types>CatalogRef.ПричиныРекламаций</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.АктПриемки</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЗаявки</name>
    <type>
      <types>EnumRef.СостоянияКоррекции</types>
    </type>
  </attributes>
  <attributes>
    <name>Отработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИсходногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРекламации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРекламации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоИсх</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаРекламации</name>
      <type>
        <types>CatalogRef.ПричиныРекламаций</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеЗаявки</name>
      <type>
        <types>EnumRef.СостоянияКоррекции</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФактСогласовано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоСогласовано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДельтаСогласовано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/СостоянияКоррекции/СостоянияКоррекции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияКоррекции</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Утверждена</name>
  </enumValues>
  <enumValues>
    <name>Принята</name>
  </enumValues>
  <enumValues>
    <name>ПринятаЧастично</name>
  </enumValues>
  <enumValues>
    <name>Отклонена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
  <enumValues>
    <name>Отработана</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыРекламаций/ВидыРекламаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРекламаций</name>
  <enumValues>
    <name>Рекламация</name>
  </enumValues>
  <enumValues>
    <name>Вычерк</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Enums/ВидыОплаты/ВидыОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОплаты</name>
  <enumValues>
    <name>НАЛ</name>
    <comment>Наличные</comment>
  </enumValues>
  <enumValues>
    <name>БН</name>
    <comment>Без нал</comment>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/ЗаявкаНаРекламацию/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если ОбменДанными.Загрузка  Тогда Возврат КонецЕсли;
	
	Если СостояниеЗаявки = Перечисления.СостоянияКоррекции.Утверждена Тогда
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Не известно, чем заполнить!!!!
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ДанныеЗаполнения = Неопределено ИЛИ ДанныеЗаполнения.Пустая() Тогда Возврат КонецЕсли;
	
	Если НЕ ДанныеЗаполнения.Проведен Тогда Возврат КонецЕсли;
	
	Если ЕстьРеквизитДокумента("СостояниеНакладной", ДанныеЗаполнения.Метаданные()) Тогда
		Если ДанныеЗаполнения.СостояниеНакладной <> Перечисления.СостоянияНакладной.Отгружена Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	
	СостояниеЗаявки = Перечисления.СостоянияКоррекции.ВРаботе;
	
	ДокОснование = ДанныеЗаполнения.Ссылка;
	Если ЕстьРеквизитДокумента("Контрагент", ДанныеЗаполнения.Метаданные()) Тогда
		Корреспондент = ДанныеЗаполнения.Контрагент;
	КонецЕсли;
	
	НомерИсходногоДокумента = СокрЛП(ДокОснование.Номер);
	
	Для Каждого ИсхСтрокаТЧ ИЗ ДанныеЗаполнения.Товары Цикл
		
		Если ИсхСтрокаТЧ.ПодтвержденнаяЗаявка <> ИсхСтрокаТЧ.Количество Тогда
			СтрокаТЧ = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, ИсхСтрокаТЧ);
			
			СтрокаТЧ.КоличествоИсх	  = ИсхСтрокаТЧ.ПодтвержденнаяЗаявка;
			СтрокаТЧ.КоличествоФакт	  = ИсхСтрокаТЧ.Количество;
			
			СтрокаТЧ.КоличествоФактСогласовано      = СтрокаТЧ.КоличествоФакт;
			СтрокаТЧ.ВсегоСогласовано = СтрокаТЧ.КоличествоФактСогласовано * СтрокаТЧ.Цена;
			
			СтрокаТЧ.Количество		  = СтрокаТЧ.КоличествоИсх - СтрокаТЧ.КоличествоФактСогласовано;
			СтрокаТЧ.Всего			  = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ПересчитатьСуммуИКоличествоДокумента();
	
КонецПроцедуры

Процедура ПересчитатьСуммуИКоличествоДокумента() Экспорт
	
	СуммаДокумента = Товары.Итог("ВсегоСогласовано");
	КоличествоДокумента = Товары.Итог("КоличествоФактСогласовано");
	
	СуммаРекламации = 0; КоличествоРекламации = 0;
	Для Каждого Стр ИЗ Товары Цикл
		Если Стр.ДельтаСогласовано <> 0 Тогда
			СуммаРекламации = СуммаРекламации + Стр.ВсегоСогласовано;
			КоличествоРекламации = КоличествоРекламации + Стр.КоличествоФактСогласовано;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Функция Отклонить() Экспорт
	
	Для Каждого СтрокаТЧ ИЗ Товары Цикл
		СтрокаТЧ.СостояниеЗаявки = Перечисления.СостоянияКоррекции.Отклонена;
		СтрокаТЧ.КоличествоФактСогласовано = 0;
		СтрокаТЧ.ВсегоСогласовано = 0;
	КонецЦикла;
	
	СостояниеЗаявки = Перечисления.СостоянияКоррекции.Отклонена;
	
	Менеджер = Справочники.ФизическиеЛица.ПустаяСсылка();
	Если ЗначениеЗаполнено(ДокОснование) Тогда
		Если ЕстьРеквизитДокумента("Менеджер", ДокОснование.Метаданные()) Тогда
			Менеджер = ДокОснование.Менеджер;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		Записать();
		Если ЗначениеЗаполнено(Автор) Тогда
			Документы.ЗаявкаНаРекламацию.СформироватьОтбивку(Ссылка, "Заявка отклонена!",, Автор);
		КонецЕсли;
		Если ЗначениеЗаполнено(Менеджер) И Менеджер <> Автор Тогда
			Документы.ЗаявкаНаРекламацию.СформироватьОтбивку(Ссылка, "Заявка отклонена!",, Менеджер);
		КонецЕсли;
	Исключение
		СообщитьОбОшибке(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Функция Утвердить() Экспорт
	
	Для Каждого СтрокаТЧ ИЗ Товары Цикл
		СтрокаТЧ.СостояниеЗаявки = Перечисления.СостоянияКоррекции.Утверждена;
	КонецЦикла;
	
	СостояниеЗаявки = Перечисления.СостоянияКоррекции.Утверждена;
	
	Попытка
		Записать();
		Документы.ЗаявкаНаРекламацию.СформироватьОтбивку(Ссылка, "Заявка утверждена!");
	Исключение
		СообщитьОбОшибке(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Функция Отработать() Экспорт
	
	/// п.17 ТЗ
	
	Если Товары.Итог("КоличествоФактСогласовано") = 0 Тогда
		Отклонить();
		Возврат Истина;
	КонецЕсли;
	
	Если Товары.Итог("КоличествоФактСогласовано") = Товары.Итог("КоличествоФакт") Тогда
		СостояниеЗаявки = Перечисления.СостоянияКоррекции.Принята;
	Иначе
		СостояниеЗаявки = Перечисления.СостоянияКоррекции.ПринятаЧастично;
	КонецЕсли;
	
	Попытка
		Записать();
	Исключение
		СообщитьОбОшибке(ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	ДополнительныеРеквизиты = Новый Структура("Дата, ВидРекламации, Отработано, ВидОплаты, ПроводитьПоОстаткам",
		ТекущаяДатаСеанса(), Перечисления.ВидыРекламаций.Вычерк, Ложь, Перечисления.ВидыОплаты.БН, Истина);
	
	РекламацияСсылка = Документы.ЗаявкаНаРекламацию.СоздатьДокументРекламационнаяНакладная(Ссылка, ДополнительныеРеквизиты, Истина);
	
	Если РекламацияСсылка <> Неопределено Тогда
		
		КСФ = Документы.ЗаявкаНаРекламацию.СоздатьДокументКорректировочнаяСФ(РекламацияСсылка);
		
		Менеджер = Справочники.ФизическиеЛица.ПустаяСсылка();
		Если ЗначениеЗаполнено(ДокОснование) Тогда
			Если ЕстьРеквизитДокумента("Менеджер", ДокОснование.Метаданные()) Тогда
				Менеджер = ДокОснование.Менеджер;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПричинаРекламации) тогда
			ЗаписатьЗначениеВРеквизитыДокументов(ПричинаРекламации, РекламацияСсылка,"ПричинаРекламации");	
		КонецЕсли;

		Если ЗначениеЗаполнено(Автор) Тогда
			Документы.ЗаявкаНаРекламацию.СформироватьОтбивку(Ссылка, "Заявка отработана!",, Автор);
		КонецЕсли;
		Если ЗначениеЗаполнено(Менеджер) И Менеджер <> Автор Тогда
			Документы.ЗаявкаНаРекламацию.СформироватьОтбивку(Ссылка, "Заявка отработана!",, Менеджер);
		КонецЕсли;
		
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
